[
  {
    "set_name": "Archaic Petra",
    "bonus": {
      "2-piece": "Gain a 15% Geo DMG Bonus.",
      "4-piece": "Upon obtaining an Elemental Shard Created through a Crystallize Reaction, all party members gain a 35% DMG Bonus for that particular element for 10s. Only one form of Elemental DMG Bonus can be gained in this manner at any one time."
    }
  },
  {
    "set_name": "Blizzard Strayer",
    "bonus": {
      "2-piece": "Cryo DMG Bonus +15%",
      "4-piece": "When a character attacks an enemy affected by Cryo, their CRIT Rate is increased by 20%. If the enemy is Frozen, CRIT Rate is increased by an additional 20%."
    }
  },
  {
    "set_name": "Bloodstained Chivalry",
    "bonus": {
      "2-piece": "Physical DMG +25%",
      "4-piece": "After defeating an opponent, increases Charged Attack DMG by 50% and reduces its Stamina cost to 0 for 10s."
    }
  },
  {
    "set_name": "Crimson Witch of Flames",
    "bonus": {
      "2-piece": "Pyro DMG Bonus +15%.",
      "4-piece": "Increases Overloaded, Burning, and Burgeon DMG by 40%. Increases Vaporize and Melt DMG by 15%. Using an Elemental Skill increases  Set effects by 50% for 10s. Max 3 stacks."
    }
  },
  {
    "set_name": "Deepwood Memories",
    "bonus": {
      "2-piece": "Dendro DMG Bonus +15%",
      "4-piece": "After Elemental Skills or Bursts hit opponents, the targets' Dendro RES will be decreased by 30% for 8s. This effect can be triggered even if the equipping character is not on the field."
    }
  },
  {
    "set_name": "Desert Pavilion Chronicle",
    "bonus": {
      "2-piece": "Anemo DMG Bonus +15%",
      "4-piece": "When Charged Attacks hit opponents, the equipping character's Normal Attack speed will increase by 10% while Normal, Charged, and Plunging Attack DMG will increase by 40% for 15s"
    }
  },
  {
    "set_name": "Echoes of an Offering",
    "bonus": {
      "2-piece": "ATK +18%.",
      "4-piece": "When Normal Attacks hit opponents, there is a 36% chance that it will trigger Valley Rite, which will increase Normal Attack DMG by 70% of ATK. This effect will be dispelled 0.05s after a Normal Attack deals DMG. If a Normal Attack fails to trigger Valley Rite, the odds of it triggering the next time will increase by 20%. This trigger can occur once every 0.2s."
    }
  },
  {
    "set_name": "Emblem of Severed Fate",
    "bonus": {
      "2-piece": "Energy Recharge +20%.",
      "4-piece": "Increases Elemental Burst DMG by 25% of Energy Recharge. A maximum of 75% bonus DMG can be obtained in this way."
    }
  },
  {
    "set_name": "Flower of Paradise Lost",
    "bonus": {
      "2-piece": "Elemental Mastery +80",
      "4-piece": "The equipping character's Bloom, Hyperbloom, and Burgeon reaction DMG are increased by 40%. Additionally, after the equipping character triggers Bloom, Hyperbloom, or Burgeon, they will gain another 25% bonus to the effect mentioned prior. Each stack of this lasts 10s. Max 4 stacks simultaneously. This effect can only be triggered once per second. The character who equips this can still trigger its effects when not on the field."
    }
  },
  {
    "set_name": "Gilded Dreams",
    "bonus": {
      "2-piece": "Elemental Mastery +80",
      "4-piece": "Within 8s of triggering an Elemental Reaction, the character equipping this will obtain buffs based on the Elemental Type of the other party members. ATK is increased by 14% for each member whose Elemental Type is the same as the equipping character, and EM is increased by 50 for every member with a different Elemental Type. Each of the buffs will count up to 3 characters. This effect can be triggered once every 8s and even when not on the field."
    }
  },
  {
    "set_name": "Gladiator's Finale",
    "bonus": {
      "2-piece": "ATK +18%.",
      "4-piece": "If the wielder of this artifact set uses a Sword, Claymore or Polearm, increases their Normal Attack DMG by 35%."
    }
  },
  {
    "set_name": "Golden Troupe",
    "bonus": {
      "2-piece": "Elemental Skill DMG +20%",
      "4-piece": "Increases Elemental Skill DMG by 25%. Additionally when not on the field, Elemental Skill DMG will be further increased by 25%. This effect will be cleared 2s after taking the field."
    }
  },
  {
    "set_name": "Heart of Depth",
    "bonus": {
      "2-piece": "Hydro DMG Bonus +15%",
      "4-piece": "After using Elemental Skill, increases Normal Attack and Charged Attack DMG by 30% for 15s."
    }
  },
  {
    "set_name": "Husk of Opulent Dreams",
    "bonus": {
      "2-piece": "DEF +30%",
      "4-piece": "A character equipped with this Artifact set will obtain the Curiosity effect in the following conditions"
    }
  },
  {
    "set_name": "Lavawalker",
    "bonus": {
      "2-piece": "Pyro RES increased by 40%.",
      "4-piece": "Increased DMG against enemies affected by Pyro by 35%."
    }
  },
  {
    "set_name": "Maiden Beloved",
    "bonus": {
      "2-piece": "Character Healing Effectiveness +15%.",
      "4-piece": "Using an Elemental Skill or Burst increases healing received by all party members by 20% for 10s."
    }
  },
  {
    "set_name": "Marechaussee Hunter",
    "bonus": {
      "2-piece": "Normal and Charged Attack DMG +15%",
      "4-piece": "When current HP increases or decreases, CRIT Rate will be increased by 12% for 5s. Max 3 stacks."
    }
  },
  {
    "set_name": "Nighttime Whispers In The Echoing Woods",
    "bonus": {
      "2-piece": "ATK +18%",
      "4-piece": "After using an Elemental Skill, gain a 20% Geo DMG Bonus for 10s. While under a shield granted by the Crystallize reaction, the above effect will be increased by 150%, and this additional increase disappears 1s after that shield is lost."
    }
  },
  {
    "set_name": "Noblesse Oblige",
    "bonus": {
      "2-piece": "Elemental Burst DMG +20%.",
      "4-piece": "Using an Elemental Burst increases all party members' ATK by 20% for 12s. This effect cannot stack."
    }
  },
  {
    "set_name": "Nymph's Dream",
    "bonus": {
      "2-piece": "Hydro DMG bonus +15%",
      "4-piece": "After Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts hit opponents, 1 stack of Mirrored Nymph will be triggered, lasting 8s. When under the effect of 1, 2, or 3 or more Mirrored Nymph Stacks, ATK will be increased by 7%/16%/25%, and Hydro DMG bonus will be increased by 4%/9%/15%. Mirrored Nymph stacks created by Normal, Charged, and Plunging Attacks, Elemental Skills, and Elemental Bursts exist independently."
    }
  },
  {
    "set_name": "Ocean-Hued Clam",
    "bonus": {
      "2-piece": "Healing Bonus +15%",
      "4-piece": "When the character with this artifact set heals a party member, 1 Foam will appear. It accumulates healed HP for 3 seconds, then explodes and deals 90% of the HP healed as DMG to nearby enemies. Max accumulated healing is 30,000 HP, including over-heal. There can only be 1 Foam active, but it stays even if you swap out. Foam CD is 3.5s."
    }
  },
  {
    "set_name": "Pale Flame",
    "bonus": {
      "2-piece": "Physical DMG +25%",
      "4-piece": "When an Elemental skill hits an opponent, ATK is increased by 9% for 7s. This effect stacks up to 2 times and can be triggered once every 0.3s. Once 2 stacks are reached, 2-set effect is doubled."
    }
  },
  {
    "set_name": "Retracing Bolide",
    "bonus": {
      "2-piece": "Increases Shield Strength by 35%",
      "4-piece": "While protected by a shield, gain an additional 40% Normal and Charged Attack DMG."
    }
  },
  {
    "set_name": "Shimenawa's Reminiscence",
    "bonus": {
      "2-piece": "ATK +18%.",
      "4-piece": "When casting an Elemental Skill, if the character has 15 or more Energy, they lose 15 Energy and Normal/Charge/Plunging Attack DMG is increased by 50% for 10s. This effect will not trigger again during that duration."
    }
  },
  {
    "set_name": "Song of Days Past",
    "bonus": {
      "2-piece": "Healing Bonus +15%",
      "4-piece": "When the equipping character heals a party member, the Yearning effect will be created for 6s, which records the total amount of healing provided (including overflow healing). When the duration expires, the Yearning effect will be transformed into the Waves of Days Past effect"
    }
  },
  {
    "set_name": "Tenacity of the Millelith",
    "bonus": {
      "2-piece": "HP +20%",
      "4-piece": "When an Elemental Skill hits an opponent, the ATK of all nearby party members is increased by 20% and their Shield Strength is increased by 30% for 3s. This effect can be triggered once every 0.5s. This effect can still be triggered even when the character who is using this artifact set is not on the field."
    }
  },
  {
    "set_name": "Thundering Fury",
    "bonus": {
      "2-piece": "Electro DMG Bonus +15%",
      "4-piece": "Increases damage caused by Overloaded, Electro-Charged, Superconduct, and Hyperbloom by 40%, and the DMG Bonus conferred by Aggravate is increased by 20%. When Quicked or the aforementioned Elemental Reactions are triggered, Elemental Skill CD is decreased by 1s. Can only occur once every 0.8s"
    }
  },
  {
    "set_name": "Thundersoother",
    "bonus": {
      "2-piece": "Electro RES increased by 40%.",
      "4-piece": "Increases DMG against enemies affected by Electro by 35%."
    }
  },
  {
    "set_name": "Vermillion Hereafter",
    "bonus": {
      "2-piece": "ATK +18%.",
      "4-piece": "After using an Elemental Burst, this character will gain the Nascent Light effect, increasing their ATK by 8% for 16s. When the character's HP decreases, their ATK will further increase by 10%. This further increase can occur this way a maximum of 4 times. This effect can be triggered once every 0.8s. Nascent Light will be dispelled when the character leaves the field. If an Elemental Burst is used again during the duration of Nascent Light, the original Nascent Light will be dispelled."
    }
  },
  {
    "set_name": "Viridescent Venerer",
    "bonus": {
      "2-piece": "Anemo DMG Bonus +15%",
      "4-piece": "Increases Swirl DMG by 60%. Decreases opponent's Elemental RES to the element infused in the Swirl by 40% for 10s."
    }
  },
  {
    "set_name": "Vourukasha's Glow",
    "bonus": {
      "2-piece": "HP +20%",
      "4-piece": "Elemental Skill and Elemental Burst DMG will be increased by 10%. After the equipping character takes DMG, the aforementioned DMG Bonus is increased by 80% for 5s. This effect increase can have 5 stacks. The duration of each stack is counted independently. These effects can be triggered even when the equipping character is not on the field."
    }
  },
  {
    "set_name": "Wanderer's Troupe",
    "bonus": {
      "2-piece": "Increases Elemental Mastery by 80.",
      "4-piece": "Increases Charged Attack DMG by 35% if the character uses a Catalyst or a Bow."
    }
  }
]
